# AreInnerRegionsOpenings Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..AreInnerRegionsOpenings Property
IFCExtrusionCreationData Class See Also
---
True if inner regions of the extrusion should become openings, false otherwise.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool AreInnerRegionsOpenings { get; set; }
```

Visual Basic
---
```text
Public Property AreInnerRegionsOpenings As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AreInnerRegionsOpenings {
	bool get ();
	void set (bool value);
}
```

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace